## Plans :thumbsup:
## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # kubernetes_deployment.blue will be created
+   resource "kubernetes_deployment" "blue" {
+       id               = (known after apply)
+       wait_for_rollout = true

+       metadata {
+           generation       = (known after apply)
+           name             = "blue-app"
+           namespace        = "default"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           min_ready_seconds         = 0
+           paused                    = false
+           progress_deadline_seconds = 600
+           replicas                  = "3"
+           revision_history_limit    = 10

+           selector {
+               match_labels = {
+                   "app" = "blue"
                }
            }

+           template {
+               metadata {
+                   generation       = (known after apply)
+                   labels           = {
+                       "app" = "blue"
                    }
+                   name             = (known after apply)
+                   resource_version = (known after apply)
+                   uid              = (known after apply)
                }
+               spec {
+                   automount_service_account_token  = true
+                   dns_policy                       = "ClusterFirst"
+                   enable_service_links             = true
+                   host_ipc                         = false
+                   host_network                     = false
+                   host_pid                         = false
+                   hostname                         = (known after apply)
+                   node_name                        = (known after apply)
+                   restart_policy                   = "Always"
+                   scheduler_name                   = (known after apply)
+                   service_account_name             = (known after apply)
+                   share_process_namespace          = false
+                   termination_grace_period_seconds = 30

+                   container {
+                       image                      = "my-app:blue-version"
+                       image_pull_policy          = (known after apply)
+                       name                       = "blue-app-container"
+                       stdin                      = false
+                       stdin_once                 = false
+                       termination_message_path   = "/dev/termination-log"
+                       termination_message_policy = (known after apply)
+                       tty                        = false

+                       port {
+                           container_port = 8080
+                           protocol       = "TCP"
                        }
                    }
                }
            }
        }
    }

  # kubernetes_deployment.green will be created
+   resource "kubernetes_deployment" "green" {
+       id               = (known after apply)
+       wait_for_rollout = true

+       metadata {
+           generation       = (known after apply)
+           name             = "green-app"
+           namespace        = "default"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           min_ready_seconds         = 0
+           paused                    = false
+           progress_deadline_seconds = 600
+           replicas                  = "3"
+           revision_history_limit    = 10

+           selector {
+               match_labels = {
+                   "app" = "green"
                }
            }

+           template {
+               metadata {
+                   generation       = (known after apply)
+                   labels           = {
+                       "app" = "green"
                    }
+                   name             = (known after apply)
+                   resource_version = (known after apply)
+                   uid              = (known after apply)
                }
+               spec {
+                   automount_service_account_token  = true
+                   dns_policy                       = "ClusterFirst"
+                   enable_service_links             = true
+                   host_ipc                         = false
+                   host_network                     = false
+                   host_pid                         = false
+                   hostname                         = (known after apply)
+                   node_name                        = (known after apply)
+                   restart_policy                   = "Always"
+                   scheduler_name                   = (known after apply)
+                   service_account_name             = (known after apply)
+                   share_process_namespace          = false
+                   termination_grace_period_seconds = 30

+                   container {
+                       image                      = "my-app:green-version"
+                       image_pull_policy          = (known after apply)
+                       name                       = "green-app-container"
+                       stdin                      = false
+                       stdin_once                 = false
+                       termination_message_path   = "/dev/termination-log"
+                       termination_message_policy = (known after apply)
+                       tty                        = false

+                       port {
+                           container_port = 8080
+                           protocol       = "TCP"
                        }
                    }
                }
            }
        }
    }

  # kubernetes_service.loadbalancer will be created
+   resource "kubernetes_service" "loadbalancer" {
+       id                     = (known after apply)
+       status                 = (known after apply)
+       wait_for_load_balancer = true

+       metadata {
+           generation       = (known after apply)
+           name             = "my-app-lb"
+           namespace        = "default"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       spec {
+           allocate_load_balancer_node_ports = true
+           cluster_ip                        = (known after apply)
+           cluster_ips                       = (known after apply)
+           external_traffic_policy           = (known after apply)
+           health_check_node_port            = (known after apply)
+           internal_traffic_policy           = (known after apply)
+           ip_families                       = (known after apply)
+           ip_family_policy                  = (known after apply)
+           publish_not_ready_addresses       = false
+           selector                          = {
+               "app" = "blue"
            }
+           session_affinity                  = "None"
+           type                              = "LoadBalancer"

+           port {
+               node_port   = (known after apply)
+               port        = 80
+               protocol    = "TCP"
+               target_port = "8080"
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```


</details>

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
